Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F19B.tmx
Source language: en_us
Languages: zh_cn

source: Seeking the Approval of Others
zh_cn: 寻求别人的认可

source: I have a confession to make.
zh_cn: 我要向你承认一件事。

source: I want you to like me.
zh_cn: 我要你喜欢我，而且不只是一点点。

source: And not just a little bit - I really, really want you to like me.
zh_cn: 我真的真的要你喜欢我。

source: But it's not just you.
zh_cn: 我要的不只是你喜欢我。

source: I want everyone everywhere to like me, to approve of me, to think I'm good enough.
zh_cn: 我要的是所有地方的所有人都喜欢我，认可我，认为我够好。

source: I crave universal approval.
zh_cn: 我渴望普天之下都认可我。

source: My mind laughs at such statements.
zh_cn: 对于这种说法，我的心里就会笑。

source: Of course I can't have everyone like me, I remind myself.
zh_cn: 我会提醒自己，我当然不可能让所有人喜欢我。

source: But still, my heart craves.
zh_cn: 但是我的心仍然这么渴望着。

source: There are some good aspects to this.
zh_cn: 这种想法是有一些好处。

source: This desire makes me generally kind, benevolent, non-confrontational.
zh_cn: 这种渴望，会让我变得大致上善良、仁慈、又非对抗性。

source: But it also makes me vulnerable. To pretty much everyone and everything.
zh_cn: 但是，它也让我几乎对所有人、所有事物，都很脆弱。

source: This desire started from a good place.
zh_cn: 这种渴望，起源于一个好的出发点。

source: I remember looking around me and constantly seeing people who were close-minded, people who were absolutely unwilling to see another's viewpoint, people who seemed incapable of seeing fault in themselves.
zh_cn: 我记得我曾观察周围，总是看到思想狭隘的人、完全不愿理解另一个人的观点的人、似乎不能看到自己的缺点的人。

source: And I vowed to be different.
zh_cn: 我就发誓，要和他们不一样。

source: I vowed to keep my mind open and to constantly try to assess myself appropriately. To see things from another's perspective. To be humble.
zh_cn: 我发誓让我的思想开放、不断适当地衡量自己、从别人的角度看待事物、要谦虚。

source: But of course, different people have different values and goals and personality traits, and so it's quite literally impossible to please all the people all the time.
zh_cn: 当然，每个人有不同的价值观、目标与性格，所以要每时每刻讨好所有的人，简直是不可能的。

source: But that didn't stop me from trying.
zh_cn: 但这并没有阻止我这样尝试。

source: When I was younger, I did this by being a chameleon of sorts.
zh_cn: 我年轻的时候，就因为这样，而变成了一只“变色龙”。

source: Without even consciously being aware of it, I would subtly change who I was to please the people I was with.
zh_cn: 我会浑然不觉地微妙地改变我的性格，以讨好那些和我一起的人。

source: I would try to remain authentic, but the simple fact that this word scared me proves that I wasn't all that good at it.
zh_cn: 我会试图保持真诚，但是“真诚”这个词就让我害怕，证明了我这方面的功力真的不足。

source: I would try to change what I could change while remaining true to who I was inside.
zh_cn: 我会尝试改变我能改变的事物，同时内心又保持忠于自己。

source: It was a dangerous tight rope to walk.
zh_cn: 这对我来说，简直进退维谷。

source: The good news is that the older I get, the less I am able to live that way.
zh_cn: 好消息是，我年纪越大，我越不能这么生活。

source: I have become a bit more sure of myself. A bit less willing to compromise myself. A bit more solid and stable.
zh_cn: 我对自己已经有多一点的肯定，多一点不愿委曲求全，也多一点坚固稳定。

source: And as such, I've come to a place where when the depression isn't overtaking me, I sometimes do kind of like who I am.
zh_cn: 因此，我已经达到了抑郁症不会压倒自己的地步。我有时候还蛮喜欢自己的个性。

source: I can see myself as a whole person.
zh_cn: 我可以视自己为一个完整的人。

source: I trust myself.
zh_cn: 我信任自己。

source: Except when I'm around people who really don't like who I am, who don't trust who I am, who would kind of prefer that I wasn't around.
zh_cn: 除了当我周围有不喜欢我的个性的人，或者不信任我的人，或者宁愿我不在的人以外。

source: Then I get lost.
zh_cn: 我就会迷惘。

source: And not just a little lost.
zh_cn: 不只是一点点迷惘。

source: I am overcome by panic.
zh_cn: 我会惊慌失措。

source: My mind starts to swirl.
zh_cn: 我的大脑开始混乱。

source: I try to figure out how I should act because if I were acting according to how I feel, I would be pandering for approval or I would be railing against maltreatment ­ or else I wouldn't be there at all.
zh_cn: 我尝试弄清楚应该怎么行事，因为若是根据我的感受的话，我理应迎合他们以求认可，或者抱怨自己被虐待了。不然，我才不会来到这里。

source: Authenticity during those moments comes at too high of a price.
zh_cn: 在那种场合中表现得真诚，代价太高了。

source: Sadly, I've started to realize that when I encounter such situations, the ramifications last for days.
zh_cn: 遗憾的，我已经开始意识到，当我遇到这种情况的时候，后果会持续好几天。

source: I wake up the next morning not knowing what to do or how to act because everything I thought of myself has been replaced by the negative evaluations of others.
zh_cn: 我第二天早上起床的时候，会不知如何是好，因为我对自己的想法，已经被别人的负面评价所取代了。

source: I try to see things from all perspectives.
zh_cn: 我尝试以各种角度看待事物。

source: I try to understand why people feel the ways about me that they do.
zh_cn: 我尝试了解为什么人们对我会有这样的感觉。

source: I try to be fair to all sides.
zh_cn: 我尝试对各方都公平。

source: But what I end up doing is much different.
zh_cn: 但我真正做到的， 却完全不同。

source: What I end up doing is letting all those negative sentiments overtake my own view of myself.
zh_cn: 我所做到的，只是允许这些负面的情绪超越了我对自己的想法。

source: I don't become an empty vessel ¨C I become a vessel full of all the negative opinions others have of me.
zh_cn: 我不是变成了空容器，我这个容器反而充满了别人对我的负面想法。

source: And so I'm stuck with this dilemma.
zh_cn: 因此，我被困在这个矛盾之间。

source: How do I overcome this?
zh_cn: 我要怎么克服它？

source: How do I stop letting other people's perspectives and priorities usurp mine?
zh_cn: 我要如何停止让别人的观点和优先考虑侵占我的那些？

source: How do I stop from feeling broken down by other's negative estimations of who I am?
zh_cn: 我要如何停止因为别人对我人格的负面评价而感到崩溃？

source: How do I do this while staying open minded and open to change?
zh_cn: 我要如何一边这么做，一边又要保持思想开放、勇于改变？

source: It's comforting to think that I have this problem because I am humble and because I want to be the best person I can be.
zh_cn: 以为自己有这方面的问题，是因为我谦虚，也因为我要做最好的人，这种想法令人感到安慰。

source: But how true is that?
zh_cn: 但是这是真的吗？

source: Do I care about what other people think because I'm humble, or do I care because I want to feel good about myself?
zh_cn: 我是在乎别人会因为我谦虚而得出的想法，或者是我在乎是因为要对自己有好感？

source: Unfortunately, I think this longing for approval is actually a longing for my own esteem, an esteem I so readily give away when I judge myself based upon another's approval.
zh_cn: 可惜的是，这种对于认可的渴望，其实是自尊的渴望。这种自尊，在我根据别人的认可而批判自己的时候，已经拱手让人了。
